Example/pt.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-12-19 Thu 11:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Common Lisp Practicum Test</title>
<meta name="author" content="Marcus" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Common Lisp Practicum Test</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0158ce8">1. Questions</a>
<ul>
<li><a href="#org2ac660a">1.1. Question 1</a></li>
<li><a href="#orgf36d489">1.2. Question 2 :penalty 80 :forbidden (reverse nreverse)</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org0158ce8" class="outline-2">
<h2 id="org0158ce8"><span class="section-number-2">1.</span> Questions</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org2ac660a" class="outline-3">
<h3 id="org2ac660a"><span class="section-number-3">1.1.</span> Question 1</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><b><b>Part 1:</b></b> Write a function <code>count-occurrences</code> that takes an element and a list as arguments and returns the number of times the element appears in the list. You may not use the <code>COUNT</code> function.</li>
</ul>

<pre class="example" id="orgee2ba7d">
(deftest count-occurrences
  (count-occurrences 3 '(1 2 3 3 3 4)) 3
  (count-occurrences 'a '(a b a c a)) 3
  (count-occurrences 5 '(1 2 3 4)) 0)
</pre>

<ul class="org-ul">
<li><b><b>Part 2:</b></b> Write a function <code>contains-all?</code> that takes two lists as arguments and returns <code>T</code> if all elements of the first list are contained in the second list, and <code>NIL</code> otherwise.</li>
</ul>

<pre class="example" id="orgbe5fb91">
(deftest contains-all
  (contains-all? '(1 2) '(1 2 3 4)) t
  (contains-all? '(1 5) '(1 2 3 4)) nil
  (contains-all? '() '(1 2 3)) t)
</pre>

<div class="tcs" id="org312067f">
<p>
(deftest count-occurrences
    (count-occurrences 1 '(1 1 1 1 1)) 5
    (count-occurrences 0 '(1 2 3 4)) 0
    (count-occurrences 'z '(a b c z z)) 2)
</p>

<p>
(deftest contains-all
    (contains-all? '(a b) '(a b c d e)) t
    (contains-all? '(a z) '(a b c d)) nil
    (contains-all? '() '()) t)
</p>

</div>
</div>
</div>

<div id="outline-container-orgf36d489" class="outline-3">
<h3 id="orgf36d489"><span class="section-number-3">1.2.</span> Question 2 :penalty 80 :forbidden (reverse nreverse)</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Note: 
</p>
<ul class="org-ul">
<li>Save your solution in the folder: <code>~/pt/</code></li>
<li>In the parts of this question, you are not allowed to use or refer to the following Lisp functions and symbols: REVERSE, NREVERSE</li>
</ul>


<ul class="org-ul">
<li><b><b>Part 1:</b></b> Write a function <code>reverse-list</code> that takes a list as an argument and returns a new list that is the reverse of the original list. You may not use <code>REVERSE</code> or <code>NREVERSE</code>.</li>
</ul>

<pre class="example" id="org69fcf51">
(deftest reverse-list
  (reverse-list '(1 2 3 4)) '(4 3 2 1)
  (reverse-list '(a b c)) '(c b a)
  (reverse-list '()) '())
</pre>

<ul class="org-ul">
<li><b><b>Part 2:</b></b> Write a function <code>palindrome?</code> that takes a list as an argument and returns <code>T</code> if the list is a palindrome (reads the same forwards and backwards), and <code>NIL</code> otherwise. You may not use <code>REVERSE</code> or <code>NREVERSE</code>.</li>
</ul>

<pre class="example" id="org6334ed4">
(deftest palindrome
  (palindrome? '(1 2 3 2 1)) t
  (palindrome? '(a b c d)) nil
  (palindrome? '()) t)
</pre>

<div class="tcs" id="org53eaa44">
<p>
(deftest reverse-list
    (reverse-list '(1 2 3 4 5)) '(5 4 3 2 1)
    (reverse-list '()) '()
    (reverse-list '(a b c)) '(c b a))
</p>

<p>
(deftest palindrome
    (palindrome? '(x y x)) t
    (palindrome? '(x y z)) nil
    (palindrome? '()) t)
</p>

</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Marcus</p>
<p class="date">Created: 2024-12-19 Thu 11:46</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
